---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnJoinNonhitFailure
source: html/a1571de1-7d22-a3dc-bc8c-3bfc79319c06.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnJoinNonhitFailure Property

The highlighted column can't maintain attachment to the target. It will be treated as unattached until it can intersect.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnJoinNonhitFailure { get; }
```